In [113]:
import numpy as np
import pandas as pd

titanic = pd.read_csv('train.csv')

In [114]:
print(titanic.isna().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [115]:
titanic.shape

(891, 12)

In [116]:
titanic.drop(axis=1, labels=['Cabin'], inplace=True)
titanic.dropna(axis=0, how='any', inplace=True)

In [117]:
titanic.shape

(712, 11)

In [118]:
fare_bin_edges = [0,
                  titanic['Fare'].quantile(0.2),
                  titanic['Fare'].quantile(0.4),
                  titanic['Fare'].quantile(0.5),
                  titanic['Fare'].quantile(0.8),
                  max(titanic['Fare'])+1]

titanic['fare_bin'] = pd.cut(titanic['Fare'], 
                             fare_bin_edges, 
                             labels=[1,2,3,4,5])

In [119]:
age_bin_edges = [0,10,20,30,40,50,60,70,80,1000]

titanic['age_bin'] = pd.cut(titanic['Age'], 
                             age_bin_edges, 
                             labels=[10,20,30,40,50,60,
                                     70,80,999])

In [120]:
titanic['died'] = titanic['Survived'].apply(lambda x: 0 if x==1 else 1)

In [121]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,fare_bin,age_bin,died
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,1,30,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,5,40,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,2,30,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,5,40,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,2,40,1

In [142]:
pivot1 = pd.pivot_table(titanic, values=['PassengerId'], 
                        index='age_bin', columns=['Sex'],
                        aggfunc='count'
                       )
print(pivot1)

        PassengerId
Sex          female   male
age_bin
10             31.0   33.0
20             46.0   69.0
30             81.0  149.0
40             54.0  100.0
50             31.0   55.0
60             14.0   28.0
70              2.0   14.0
80              NaN    5.0

In [156]:
pivot2 = pd.pivot_table(titanic, values=['Survived'], 
                        index='age_bin', 
                        columns=['Sex','Pclass'],
                        aggfunc='mean',
                       )
pivot2.round(2)

        Survived
Sex       female              male
Pclass         1     2     3     1     2     3
age_bin
10          0.00  1.00  0.50  1.00  1.00  0.36
20          1.00  1.00  0.52  0.40  0.10  0.13
30          0.95  0.89  0.50  0.47  0.00  0.14
40          1.00  0.94  0.43  0.52  0.12  0.14
50          0.92  0.90  0.00  0.38  0.11  0.09
60          1.00  0.67   NaN  0.29  0.00  0.00
70          1.00   NaN  1.00  0.00  0.33  0.00
80           NaN   NaN   NaN  0.33   NaN  0.00

In [148]:
pivot3 = pd.pivot_table(titanic, values=['Survived'], 
                        index='Pclass', 
                        columns='Sex',
                        aggfunc='mean',
                       )
pivot3.round(2)

       Survived
Sex      female  male
Pclass
1          0.96  0.40
2          0.92  0.15
3          0.46  0.15